results/gcs_balanced/fio-rw:randrw-rwmixread:66-numjobs:1-iodepth:1-bs:4k.out
fio-rw:randrw-rwmixread:66-numjobs:1-iodepth:1-bs:4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.28
Starting 1 process
fio-rw:randrw-rwmixread:66-numjobs:1-iodepth:1-bs:4k: Laying out IO file (1 file / 4096MiB)

fio-rw:randrw-rwmixread:66-numjobs:1-iodepth:1-bs:4k: (groupid=0, jobs=1): err= 0: pid=19790: Sat Feb 24 15:58:03 2024
  read: IOPS=1691, BW=6765KiB/s (6928kB/s)(2022MiB/306047msec)
    slat (usec): min=194, max=61704, avg=568.35, stdev=1072.26
    clat (nsec): min=1194, max=94554, avg=2351.83, stdev=1389.00
     lat (usec): min=196, max=61714, avg=571.21, stdev=1072.70
    clat percentiles (nsec):
     |  1.00th=[ 1272],  5.00th=[ 1320], 10.00th=[ 1336], 20.00th=[ 1384],
     | 30.00th=[ 1464], 40.00th=[ 1592], 50.00th=[ 1896], 60.00th=[ 2448],
     | 70.00th=[ 2896], 80.00th=[ 3376], 90.00th=[ 3696], 95.00th=[ 3888],
     | 99.00th=[ 5984], 99.50th=[ 7776], 99.90th=[19328], 99.95th=[24192],
     | 99.99th=[33536]
   bw (  KiB/s): min=  328, max=10552, per=100.00%, avg=6915.81, stdev=2889.44, samples=599
   iops        : min=   82, max= 2638, avg=1728.90, stdev=722.34, samples=599
  write: IOPS=873, BW=3493KiB/s (3577kB/s)(1044MiB/306047msec); 0 zone resets
    slat (usec): min=3, max=283, avg= 8.94, stdev= 4.92
    clat (nsec): min=980, max=56394, avg=1131.92, stdev=637.27
     lat (usec): min=4, max=334, avg=10.19, stdev= 5.06
    clat percentiles (nsec):
     |  1.00th=[ 1004],  5.00th=[ 1020], 10.00th=[ 1032], 20.00th=[ 1048],
     | 30.00th=[ 1048], 40.00th=[ 1064], 50.00th=[ 1080], 60.00th=[ 1096],
     | 70.00th=[ 1128], 80.00th=[ 1160], 90.00th=[ 1208], 95.00th=[ 1272],
     | 99.00th=[ 1480], 99.50th=[ 1688], 99.90th=[ 8160], 99.95th=[15808],
     | 99.99th=[27520]
   bw (  KiB/s): min=  104, max= 5856, per=100.00%, avg=3570.65, stdev=1507.76, samples=599
   iops        : min=   26, max= 1464, avg=892.62, stdev=376.93, samples=599
  lat (nsec)   : 1000=0.14%
  lat (usec)   : 2=68.10%, 4=29.31%, 10=2.25%, 20=0.13%, 50=0.07%
  lat (usec)   : 100=0.01%
  cpu          : usr=1.44%, sys=5.13%, ctx=520302, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=517635,267261,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6765KiB/s (6928kB/s), 6765KiB/s-6765KiB/s (6928kB/s-6928kB/s), io=2022MiB (2120MB), run=306047-306047msec
  WRITE: bw=3493KiB/s (3577kB/s), 3493KiB/s-3493KiB/s (3577kB/s-3577kB/s), io=1044MiB (1095MB), run=306047-306047msec

Disk stats (read/write):
  sdc: ios=517635/253439, merge=0/4, ticks=279604/1454958, in_queue=1734564, util=100.00%